[
  {
    "yearRange": "2023 - Present",
    "company": "MagnetLab",
    "roles": [
      {
        "title": "Co-Founder & Lead Engineer",
        "period": "January 2023 – Present",
        "isCurrent": true,
        "description": "- Co-founded an AI automation company, building intelligent systems to solve real-world business problems.\n- Architected and developed SPARC, a proprietary AI-assisted development framework that enables the delivery of high-quality, fully documented websites in as little as three days.\n- Built and deployed a suite of custom AI agents to automate entire business workflows, from lead intake to social media content creation."
      }
    ],
    "logoSrc": "images/magnetlab.png",
    "logoAlt": "MagnetLab"
  },
  {
    "yearRange": "2022 - Now",
    "company": "McDonald's",
    "employer": "DirectWest Pty Ltd",
    "roles": [
      {
        "title": "On-site Technical Owner",
        "period": "March 2024 - Present",
        "isCurrent": true,
        "description": "- Acted as the primary on-site technical owner for a multi-million dollar business, responsible for maintaining critical technology infrastructure.\n- Conducted regular tech audits and preventative maintenance, achieving over 99% uptime for POS and network systems.\n- Provided rapid-response troubleshooting for technical failures, minimizing downtime and protecting revenue."
      },
      {
        "title": "Operational Management",
        "period": "June 2022 - March 2024",
        "description": "Gained front-lines experience with real-world inefficiency, technical failures, and urgent customer needs, informing a pragmatic approach to software development and problem-solving."
      }
    ],
    "logoSrc": "images/mc_logo.png",
    "logoAlt": "McDonald's"
  },
  {
    "yearRange": "2015 - 2022",
    "company": "Hospitality Management",
    "employer": "Taco Bell & McDonald's",
    "roles": [
      {
        "title": "Team & Systems Leadership",
        "period": "June 2015 - June 2022",
        "description": "Led teams and managed systems in high-pressure, customer-facing environments. This experience provided a deep understanding of operational efficiency, user experience, and the direct business impact of technology."
      }
    ],
    "logoSrc": "images/mc_logo.png",
    "logoAlt": "Hospitality Management"
  }
]
